Revit 2027 API
FamilyManager.AddParameter Method
Add a new parameter to the family.
Overload List
Name | Description
AddParameter(ExternalDefinition, ForgeTypeId, Boolean) | Add a new shared parameter to the family.
AddParameter(String, ForgeTypeId, Category, Boolean) | Add a new family type parameter to control the type of a nested family within another family.
AddParameter(String, ForgeTypeId, ForgeTypeId, Boolean) | Add a new family parameter with a given name.
Top
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace